#Входные данные

n = int(input())

#Основной код

if n>1:
    print("Vanya")
else:
    print("Vova")
